InformationRegisters/РасчетОтложенногоНалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>РасчетОтложенногоНалога</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
					<Comment>на отчетную дату</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяСтоимость</Name>
					<Comment>на отчетную дату</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяРазница</Name>
					<Comment>на отчетную дату</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложенныйНалог</Name>
					<Comment>на отчетную дату</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭффектУвеличенияВременныхРазниц</Name>
					<Comment>за отчетный период</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭффектУменьшенияВременныхРазниц</Name>
					<Comment>за отчетный период</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПогрешностьОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОтчетнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетОтложенногоНалога</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктивовИОбязательств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивовИОбязательств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РасчетОтложенногоНалога/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Приводит значение измерений ПериодРасчета и ОтчетнаяДата к принятым для регистра.
//
// Для регистра используется соглашение:
// ПериодРасчета и ОтчетнаяДата - это всегда дата начала месяца.
// Это сделано, чтобы в справках-расчетах было проще получать данные
// (избежать неоднозначности, на какую конкретно дату в течение месяца выбирать данные).
// См. также ПериодРасчета()
//
// Параметры:
//  ПериодРасчета  - Дата - значение измерения ПериодРасчета.
//
Процедура ПривестиПериодРасчета(ПериодРасчета) Экспорт
	
	ПериодРасчета = НачалоМесяца(ПериодРасчета);
	
КонецПроцедуры

// Определяет период расчета, за который в регистре записаны данные на отчетную дату.
//
// ПериодРасчета определяет период, расчет которого выполняется регламентной операцией.
//
// Как правило, регламентная операция рассчитывает данные на отчетную дату, непосредственно следующую за этим месяцем.
// Например, операция за Декабрь 2018 рассчитывает данные на отчетную дату 01 января 2019.
// В этом случае ПериодРасчета будет равен 01.12.2018, а ОтчетнаяДата - 01.01.2019.
// В подобных случаях одной отчетной дате соответствует один период отчета и они отличаются ровно на 1 месяц.
//
// Однако, при начале использования подсистемы или при пропуске регламентных операций может потребоваться
// данные на начало отчетного периода записать регламентными операциями,
// рассчитывающими данные за более поздние периоды.
//
// Измерение ПериодРасчета в дополнение к ОтчетнаяДата введено для того, чтобы избежать коллизий,
// в случаях, когда сначала выполнена регламентная операция за более поздний период, сформировавшая данные на отчетную дату,
// а потом выполняется более ранняя.
//
// В таких случаях будет записано несколько наборов данных с одинаковым значением ОтчетнаяДата, но разными значениями ПериодРасчета.
// При этом, если последовательно провести все регламентные операции,
// то однозначное соответствие ОтчетнаяДата и ПериодРасчета восстановится.
// (Исключение: начало использования подсистемы).
// 
// Как следствие, если на одну отчетную дату есть записи с разными периодами регистрации, то корректным следует считать набор
// с наименьшими периодами регистрации.
//
// Параметры:
//  НачалоПериода - Дата - отчетная дата, на которую нужны сведения.
//  Организация	  - СправочникСсылка.Организации - организация.
//  Ограничение   - Дата - период, за который выполняется расчет;
//                  записи с начальными данными должны быть рассчитаны не позднее этой даты.
// 
// Возвращаемое значение:
//  Дата - период в регистре (соответствует значению измерения ПериодРасчета).
//         Может быть пустой датой, если в регистре нет данных на отчетную дату.
//
Функция ПериодРасчета(Знач НачалоПериода, Организация, Знач Ограничение) Экспорт
	
	ПривестиПериодРасчета(НачалоПериода);
	ПривестиПериодРасчета(Ограничение);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтчетнаяДата",  НачалоПериода);
	Запрос.УстановитьПараметр("ПериодРасчета", Ограничение);
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасчетОтложенногоНалога.ПериодРасчета КАК ПериодРасчета
	|ИЗ
	|	РегистрСведений.РасчетОтложенногоНалога КАК РасчетОтложенногоНалога
	|ГДЕ
	|	РасчетОтложенногоНалога.ОтчетнаяДата = &ОтчетнаяДата
	|	И РасчетОтложенногоНалога.Организация = &Организация
	|	И РасчетОтложенногоНалога.ПериодРасчета <= &ПериодРасчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодРасчета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПериодРасчета;
	Иначе
		Возврат '0001-01-01';
	КонецЕсли;
	
КонецФункции

// Конструктор коллекции, описывающей период данных, записанных в регистр.
// Подробнее см. комментарий к ПериодРасчета
// 
// Возвращаемое значение:
//  Структура
//
Функция НовыйПериодДанных() Экспорт
	
	ПериодДанных = Новый Структура;
	ПериодДанных.Вставить("ОтчетнаяДата",  '0001-01-01');
	ПериодДанных.Вставить("ПериодРасчета", '0001-01-01');
	
	Возврат ПериодДанных;
	
КонецФункции

// Определяет период данных, записанных в регистр, соответствующий дате начала периода отчета.
//
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода  - Дата
//  Организация   - СправочникСсылка.Организации
// 
// Возвращаемое значение:
//  Структура - см. НовыйПериодДанных
//
Функция ПериодДанныхНаНачалоПериодаОтчета(НачалоПериода, КонецПериода, Организация) Экспорт
	
	ПериодДанных = НовыйПериодДанных();
	ПериодДанных.ОтчетнаяДата  = НачалоМесяца(НачалоПериода);
	ПериодДанных.ПериодРасчета = ПериодРасчета(ПериодДанных.ОтчетнаяДата, Организация, КонецПериода);
	
	Возврат ПериодДанных;
	
КонецФункции

// Определяет период данных, записанных в регистр, соответствующий дате конца периода отчета.
//
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода  - Дата
//  Организация   - СправочникСсылка.Организации
// 
// Возвращаемое значение:
//  Структура - см. НовыйПериодДанных
//
Функция ПериодДанныхНаКонецПериодаОтчета(НачалоПериода, КонецПериода, Организация) Экспорт
	
	ПериодДанных = НовыйПериодДанных();
	ПериодДанных.ОтчетнаяДата  = КонецМесяца(КонецПериода) + 1;
	ПериодДанных.ПериодРасчета = ПериодРасчета(ПериодДанных.ОтчетнаяДата, Организация, КонецПериода);
	
	Возврат ПериодДанных;
	
КонецФункции

// Настраивает период справки-расчета, который строится по данным регистра.
//
// В таких отчетах выбираются начальные данные и данные периода расчета выбираются на отчетные даты.
// При этом данные на одну и ту же отчетную дату в общем случае могут рассчитываться несколько раз.
// Поэтому каждая из дат уточняется Периодом расчета.
//
// Процедура устаналивает эти даты в компоновщике для параметров 
// - ОтчетнаяДата
// - ПериодРасчета
// - НачальныеДанныеОтчетнаяДата
// - НачальныеДанныеПериодРасчета.
//
// Параметры:
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек, в котором объявлены
//                         параметры, перечисленные выше.
//  НачалоПериода		 - Дата - начало периода, за который строится отчет. Должна быть заполнена.
//  КонецПериода		 - Дата - конец периода, за который строится отчет. Должна быть заполнена.
//  Организация			 - СправочникСсылка.Организация - организация, по данным которой строится отчет.
//
Процедура НастроитьПериодОтчета(КомпоновщикНастроек, НачалоПериода, КонецПериода, Организация) Экспорт
	
	// начальные данные
	ПериодДанных = ПериодДанныхНаНачалоПериодаОтчета(НачалоПериода, КонецПериода, Организация);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"НачальныеДанныеОтчетнаяДата",
		ПериодДанных.ОтчетнаяДата);
		
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"НачальныеДанныеПериодРасчета",
		ПериодДанных.ПериодРасчета);
	
	// период отчета
	ПериодДанных = ПериодДанныхНаКонецПериодаОтчета(НачалоПериода, КонецПериода, Организация);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"ОтчетнаяДата",
		ПериодДанных.ОтчетнаяДата);
		
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"ПериодРасчета",
		ПериодДанных.ПериодРасчета);
	
КонецПроцедуры

// Определяет, содержатся ли в регистре на конкретный период по конкретной организации данные о балансовых показателях
// (сумме бухгалтерского или налогового учета).
// Эти данные записываются, начиная с версии 3.0.75
//
// Параметры:
//  ПериодДанных - Структура - см. НовыйПериодДанных
//  Организация  - СправочникСсылка.Организации
// 
// Возвращаемое значение:
//  Булево - Истина, если данные есть.
//
Функция СодержитБалансовыеПоказатели(ПериодДанных, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПериодРасчета", ПериодДанных.ПериодРасчета);
	Запрос.УстановитьПараметр("ОтчетнаяДата",  ПериодДанных.ОтчетнаяДата);
	Запрос.УстановитьПараметр("Организация",   Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасчетОтложенногоНалога.ОтчетнаяДата КАК ОтчетнаяДата
	|ИЗ
	|	РегистрСведений.РасчетОтложенногоНалога КАК РасчетОтложенногоНалога
	|ГДЕ
	|	РасчетОтложенногоНалога.ПериодРасчета = &ПериодРасчета
	|	И РасчетОтложенногоНалога.ОтчетнаяДата = &ОтчетнаяДата
	|	И РасчетОтложенногоНалога.Организация = &Организация
	|	И (РасчетОтложенногоНалога.БалансоваяСтоимость <> 0
	|			ИЛИ РасчетОтложенногоНалога.НалоговаяСтоимость <> 0)";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
